{
  "Intro": {
    "dialog": [
      "I can still feel the heat of the flames and the echo of screams in the distance...",
      "My village has been burned down, my parents—my father, a loyal subject of the old king, and my gentle mother—lost in the chaos of the Horde’s attack.",
      "I ran into the forest, heart pounding and questions swirling: Was our king too weak? Was it betrayal or mere fate that led to our downfall?",
      "Alone with my thoughts, I struggle to make sense of it all..."
    ]
  },
  "Old Man": {
    "1": {
      "dialog": [
        "Ah... another traveler seeking answers...",
        "The world you have always known, young wanderer... was not always like this.",
        "Once, under the banner of the noble Lacorian Dynasty, this land flourished.",
        "A golden age of peace, prosperity, and unity... a time of legends.",
        "Merchants thrived, towns bustled, and the banners of Castelac flew high above the land.",
        "But peace is a fragile thing...",
        "Then came the riders from the East... merciless, swift, and unrelenting.",
        "Their horde swept through the kingdom like a storm, leaving ruin in their wake.",
        "Castelac stood tall, but even its mighty walls could not withstand the flames of war.",
        "The great kingdom shattered, its people scattered, its rulers slain or in hiding...",
        "Now, law is but a memory—warlords, fallen nobles, mercenaries, and new powers vie for control.",
        "In these troubled times, whispers speak not only of heroes but also of competing visions for the future:",
        "   - A rightful heir who claims the throne with divine right.",
        "   - A republic of the people seeking equality and self-rule.",
        "   - A general whose iron hand promises order through military might.",
        "   - Bandit lords—remnants of the Horde’s terror—who now rule by raw force.",
        "   - And a young noble, daring to imagine a modern kingdom that bridges tradition and innovation.",
        "Yet amidst all these competing voices, I sense that your own past holds secrets even deeper than these quarrels over power.",
        "Tell me, young traveler, what is your name?"
      ]
    },
    "2": {
      "dialog": [
        "Ah, it's a pleasure to meet you, {hero_name}...",
        "May I ask, what humble background do your parents come from? Was your father one of the loyal subjects of our old king, or did your roots lie in the common folk?"
      ],
      "options": [
        {
          "id": "Smith",
          "text": "Smith",
          "reply": "My father was a blacksmith, and my mother assisted him at the forge.",
          "followup": {
            "dialog": [
              "Ah, a lineage of smiths! The clanging of the hammer on the anvil must have echoed through your childhood.",
              "I admire the strength it takes to work by the forge."
            ]
          }
        },
        {
          "id": "Hunter",
          "text": "Hunter",
          "reply": "Both my parents were hunters, tracking game and trading hides at the local market.",
          "followup": {
            "dialog": [
              "A hunter, eh? The wilds are unforgiving, yet they bestow wisdom upon those who brave them.",
              "Your parents must have taught you the ways of the forest."
            ]
          }
        },
        {
          "id": "Farmer",
          "text": "Farmer",
          "reply": "They were hardworking farmers, tending the fields from dawn till dusk.",
          "followup": {
            "dialog": [
              "Farming is a noble endeavor. The earth gives, and you learn to live in harmony with nature.",
              "I hope the seasons have been kind to your family."
            ]
          }
        },
        {
          "id": "Baker",
          "text": "Baker",
          "reply": "My parents ran a small bakery, kneading dough and supplying fresh bread to the community.",
          "followup": {
            "dialog": [
              "A baker, you say? The aroma of fresh bread can warm the coldest of hearts.",
              "I can almost smell the yeast and hear the crackle of the oven."
            ]
          }
        },
        {
          "id": "Carpenter",
          "text": "Carpenter",
          "reply": "They worked as carpenters, building and repairing homes in our village.",
          "followup": {
            "dialog": [
              "Carpentry is the art of shaping wood and building dreams.",
              "I admire the art of forming something beautiful and useful from scratch."
            ]
          }
        }
      ]
    },
    "greeting": {
      "dialog": [
        "Ah, you're back, young adventurer. Tell me, have your thoughts deepened since we last spoke?",
        "In these troubled times, the realm is torn apart by competing visions—a rightful heir with an ancient claim, a republic of the people, a military force imposing order, bandit lords born of chaos, and a young noble striving for a modern future.",
        "Each faction offers its own truth. The choice is yours to ponder as you decide your own path."
      ],
      "options": [
        {
          "id": "advice",
          "text": "Old man, do you have any advice for me?",
          "reply": "My advice: Seek not only answers in the words of others but also in the silence of your own thoughts."
        },
        {
          "id": "help",
          "text": "Do you have a task for me?",
          "reply": "Indeed. I have a task: Gather the items needed to protect our village and perhaps find clues to the deeper truths of our time.",
          "followup": {
            "dialog": [
              "When you are ready, accept this task and help me recover the lost treasures of our past."
            ],
            "quest": "quest_healer2_request"
          },
          "npc_followup": {
            "dialog": [
              "Remember, young one: every item you recover may be a piece of the puzzle."
            ]
          }
        },
        {
          "id": "leave",
          "text": "I must continue on my journey.",
          "reply": "Then go forth, and let your choices shape the destiny of our shattered land."
        }
      ]
    }
  }
}
